import csv
import json

level1 = ["爱", "八", "爸", "杯", "子", "北", "京", "本", "不", "客", "气", "菜", "茶", "吃", "出", "租", "车", "打", "电", "话", "大", "的", "点", "脑", "视", "影", "东", "西", "都", 
            "读", "对", "起", "多", "少", "儿", "二", "饭", "店", "飞", "机", "分", "钟", "高", "兴", "个", "工", "作", "狗", "汉", "语", "好", "号", "喝", "和", "很", "后", "面", "回", "会", 
            "几", "家", "叫", "今", "天", "九", "开", "看", "见", "块", "来", "老", "师", "了", "冷", "里", "六", "妈", "吗", "买", "猫", "没", "关", "系", "有", "米", "名", "字", "明", "哪", 
            "那", "呢", "能", "你", "年", "女", "朋", "友", "漂", "亮", "苹", "果", "七", "前", "钱", "请", "去", "热", "人", "认", "识", "三", "商", "上", "午", "谁", "什", "么", "十", "时", 
            "候", "是", "书", "水", "睡", "觉", "说", "四", "岁", "他", "她", "太", "听", "同", "学", "喂", "我", "们", "五", "喜", "欢", "下", "雨", "先", "生", "现", "在", "想", 
            "小", "姐", "些", "写", "谢", "星", "期", "习", "校", "一", "衣", "服", "医", "院", "椅", "月", "再", "怎", "样", "这", "中", "国", "住", "桌", "昨", "坐", "做"]

level2 = ["吧", "白", "百", "帮", "助", "报", "纸", "比", "别", "宾", "馆", "长", "唱", "歌", "穿", "次", "从", "错", "篮", "球", "到", "得", "等", "弟", "第", "懂", "房", "间", "非", 
"常", "务", "员", "告", "诉", "哥", "给", "公", "共", "汽", "司", "贵", "过", "还", "孩", "黑", "红", "火", "站", "场", "鸡", "蛋", "件", "教", "室", "介", "绍", "进", "近", "就", "咖", 
"啡", "始", "考", "试", "可", "以", "课", "快", "乐", "累", "离", "两", "零", "路", "旅", "游", "卖", "慢", "忙", "每", "妹", "门", "条", "男", "您", "牛", "奶", "旁", "边", "跑", "步", 
"便", "宜", "票", "妻", "床", "千", "铅", "笔", "晴", "让", "日", "班", "身", "体", "病", "事", "情", "手", "表", "送", "虽", "然", "但", "它", "踢", "足", "题", "跳", "舞", "外", "完", 
"玩", "晚", "往", "为", "问", "瓜", "希", "望", "洗", "笑", "新", "姓", "休", "息", "雪", "颜", "色", "眼", "睛", "羊", "肉", "药", "要", "也", "已", "经", "意", "思", "因", "所", "阴", 
"泳", "右", "鱼", "远", "运", "动", "早", "丈", "夫", "找", "着", "真", "正", "知", "道", "准", "备", "走", "最", "左"]

level3 = ["姨", "啊", "阿", "矮", "安", "静", "把", "搬", "办", "法", "半", "包", "饱", "方", "被", "鼻", "较", "赛", "记", "必", "须", "变", "化", "冰", "箱", "而", "且", "单", "参", "加", 
          "草", "层", "差", "超", "市", "衬", "衫", "成", "绩", "城", "迟", "除", "船", "春", "词", "典", "聪", "扫", "算", "带", "担", "心", "糕", "当", "地", "灯", "铁", "图", "梯", "邮", 
          "冬", "物", "短", "段", "锻", "炼", "饿", "耳", "朵", "发", "烧", "放", "附", "复", "干", "净", "感", "冒", "趣", "刚", "才", "根", "据", "跟", "更", "斤", "园", "故", "刮", "风", 
          "于", "害", "怕", "板", "护", "照", "花", "画", "坏", "迎", "环", "境", "换", "黄", "河", "答", "议", "或", "者", "乎", "极", "季", "节", "检", "查", "简", "健", "康", "讲", "角", 
          "脚", "接", "街", "目", "结", "婚", "束", "解", "决", "借", "理", "久", "旧", "句", "定", "渴", "刻", "空", "调", "口", "哭", "裤", "筷", "蓝", "礼", "历", "史", "脸", "练", "辆", 
          "聊", "邻", "居", "留", "楼", "绿", "马", "满", "帽", "拿", "南", "难", "级", "轻", "鸟", "努", "力", "爬", "山", "盘", "胖", "皮", "鞋", "啤", "酒", "瓶", "其", "实", "奇", "怪", 
          "骑", "清", "楚", "假", "秋", "裙", "容", "易", "如", "伞", "网", "声", "音", "世", "界", "瘦", "叔", "舒", "树", "数", "刷", "牙", "双", "平", "阳", "特", "疼", "提", "育", "甜", 
          "头", "突", "腿", "碗", "万", "忘", "位", "文", "惯", "澡", "夏", "相", "信", "香", "蕉", "向", "像", "闻", "鲜", "用", "卡", "行", "李", "熊", "需", "选", "择", "求", "爷", "般", 
          "直", "银", "饮", "料", "应", "该", "响", "戏", "又", "遇", "元", "愿", "越", "张", "急", "顾", "片", "终", "只", "种", "重", "周", "末", "主", "注", "自", "己", "总", "嘴", "业"]

level4 = ["排", "全", "按", "之", "棒", "保", "证", "抱", "歉", "倍", "笨", "毕", "遍", "标", "格", "示", "演", "扬", "饼", "并", "博", "士", "管", "仅", "部", "擦", "猜", "材", "观", "餐", 
          "厅", "厕", "江", "功", "诚", "乘", "惊", "抽", "烟", "厨", "传", "窗", "户", "粗", "存", "误", "案", "扮", "扰", "印", "招", "呼", "折", "针", "概", "使", "约", "戴", "刀", "导", 
          "处", "底", "倒", "登", "牌", "低", "址", "掉", "丢", "堵", "肚", "童", "展", "律", "翻", "译", "烦", "恼", "反", "弃", "暑", "松", "份", "丰", "富", "否", "则", "符", "合", "父", 
          "亲", "付", "款", "负", "责", "杂", "改", "赶", "敢", "速", "胳", "膊", "各", "资", "购", "够", "估", "计", "鼓", "励", "挂", "键", "众", "光", "广", "播", "逛", "规", "籍", "际", 
          "汁", "程", "海", "洋", "羞", "寒", "汗", "航", "码", "适", "盒", "悔", "厚", "互", "联", "怀", "疑", "忆", "活", "泼", "获", "积", "基", "础", "激", "及", "即", "划", "技", "术", 
          "既", "继", "续", "寄", "油", "具", "价", "坚", "持", "减", "肥", "建", "将", "奖", "金", "降", "落", "交", "流", "通", "郊", "区", "骄", "傲", "饺", "授", "受", "释", "尽", "紧", 
          "禁", "止", "剧", "济", "验", "精", "彩", "景", "警", "察", "竞", "争", "竟", "镜", "究", "举", "拒", "绝", "距", "聚", "虑", "烤", "鸭", "科", "棵", "咳", "嗽", "怜", "惜", "肯", 
          "恐", "苦", "矿", "泉", "困", "垃", "圾", "桶", "拉", "辣", "懒", "浪", "费", "漫", "虎", "拜", "貌", "厉", "例", "俩", "连", "凉", "另", "利", "乱", "麻", "毛", "巾", "美", "丽", 
          "梦", "迷", "密", "免", "秒", "民", "族", "母", "耐", "内", "龄", "弄", "暖", "偶", "尔", "队", "列", "判", "断", "陪", "批", "评", "肤", "脾", "篇", "骗", "乒", "乓", "破", "葡", 
          "萄", "普", "签", "敲", "桥", "巧", "克", "戚", "况", "穷", "取", "缺", "却", "确", "闹", "任", "何", "扔", "仍", "入", "散", "森", "林", "沙", "伤", "量", "稍", "微", "勺", "社", 
          "申", "深", "甚", "至", "命", "省", "剩", "失", "败", "傅", "纪", "收", "拾", "首", "售", "货", "输", "熟", "悉", "帅", "顺", "序", "硕", "死", "度", "塑", "袋", "酸", "随", "孙", 
          "台", "抬", "态", "谈", "弹", "钢", "琴", "汤", "糖", "躺", "趟", "讨", "论", "厌", "供", "醒", "填", "停", "挺", "推", "脱", "袜", "危", "险", "卫", "味", "温", "章", "污", "染",
          "无", "柿", "吸", "引", "咸", "羡", "慕", "详", "细", "橡", "消", "伙", "效", "辛", "封", "奋", "幸", "福", "性", "修", "许", "压", "呀", "膏", "亚", "洲", "严", "研", "盐", "养", 
          "邀", "钥", "匙", "叶", "页", "切", "艺", "此", "象", "赢", "聘", "永", "勇", "优", "秀", "幽", "默", "尤", "由", "局", "谊", "愉", "与", "羽", "言", "预", "原", "谅", "阅", "云", 
          "允", "志", "咱", "暂", "脏", "增", "占", "线", "整", "式", "支", "值", "职", "植", "指", "质", "围", "祝", "贺", "著", "专", "转", "赚", "仔", "尊", "座", "尝"]

level5 = ["哎", "唉", "慰", "装", "岸", "暗", "熬", "夜", "握", "摆", "傍", "裹", "含", "括", "薄", "宝", "贝", "怨", "背", "悲", "领", "彼", "避", "编", "辑", "鞭", "炮", "辩", "达", "凌", 
          "毒", "玻", "璃", "脖", "补", "充", "布", "骤", "财", "产", "采", "访", "虹", "踩", "惭", "愧", "操", "册", "测", "曾", "叉", "插", "拆", "品", "途", "抄", "朝", "潮", "湿", "吵", 
          "架", "炒", "库", "厢", "彻", "沉", "趁", "称", "赞", "立", "恳", "承", "亏", "池", "塘", "尺", "翅", "膀", "冲", "器", "宠", "屉", "丑", "臭", "版", "席", "初", "夕", "统", "帘", 
          "闯", "创", "造", "吹", "汇", "辞", "刺", "匆", "糙", "促", "醋", "催", "措", "施", "喷", "嚏", "厦", "型", "呆", "代", "替", "贷", "待", "纯", "独", "耽", "胆", "鬼", "淡", "挡", 
          "致", "岛", "屿", "霉", "德", "滴", "敌", "毯", "震", "递", "钓", "顶", "冻", "洞", "豆", "腐", "逗", "堆", "兑", "吨", "蹲", "顿", "余", "躲", "藏", "恶", "劣", "愁", "抖", "挥", 
          "罚", "繁", "荣", "映", "范", "妨", "碍", "仿", "佛", "皂", "废", "配", "析", "纷", "斗", "俗", "疯", "狂", "讽", "扶", "幅", "辅", "妇", "制", "革", "善", "盖", "念", "脆", "燥", 
          "档", "搞", "隔", "壁", "厂", "寓", "恭", "贡", "献", "沟", "构", "姑", "娘", "古", "股", "骨", "掌", "固", "乖", "拐", "弯", "闭", "官", "冠", "军", "滑", "临", "泛", "归", "纳", 
          "矩", "模", "柜", "滚", "锅", "庆", "王", "敏", "哈", "喊", "豪", "华", "核", "恨", "猴", "忽", "胡", "壶", "蝴", "蝶", "糊", "涂", "裔", "孕", "缓", "幻", "慌", "灰", "尘", "恢", 
          "率", "姻", "跃", "柴", "伴", "肌", "烈", "诊", "集", "录", "寂", "寞", "夹", "庭", "乡", "嘉", "甲", "设", "驾", "驶", "嫁", "强", "肩", "艰", "巨", "兼", "捡", "剪", "筑", "酱", 
          "浇", "胶", "狡", "猾", "训", "阶", "触", "账", "戒", "届", "属", "谨", "慎", "营", "神", "救", "舅", "桔", "俱", "捐", "均", "匀", "幕", "砍", "靠", "颗", "闲", "控", "夸", "宽", 
          "昆", "虫", "扩", "椒", "拦", "烂", "朗", "劳", "婆", "鼠", "姥", "雷", "类", "厘", "梨", "润", "益", "恋", "良", "粮", "食", "灵", "铃", "域", "浏", "览", "泪", "龙", "漏", "陆", 
          "轮", "逻", "骂", "麦", "馒", "矛", "盾", "贸", "眉", "媒", "煤", "炭", "魅", "秘", "蜜", "蜂", "苗", "描", "胜", "迹", "显", "令", "摸", "摩", "托", "陌", "某", "木", "嫩", "源", 
          "嗯", "宁", "农", "村", "浓", "欧", "拍", "派", "盼", "培", "赔", "偿", "佩", "盆", "碰", "披", "疲", "匹", "飘", "拼", "频", "衡", "凭", "迫", "企", "启", "氛", "谦", "虚", "浅", 
          "欠", "枪", "墙", "抢", "悄", "瞧", "妙", "勤", "青", "绪", "趋", "势", "娶", "圈", "权", "劝", "乏", "群", "燃", "绕", "币", "忍", "软", "弱", "洒", "嗓", "杀", "漠", "滩", "傻", 
          "晒", "删", "闪", "扇", "蛇", "舍", "射", "击", "摄", "伸", "升", "绳", "略", "眠", "诗", "狮", "石", "髦", "尚", "践", "劲", "兵", "似", "卷", "套", "寿", "梳", "蔬", "摔", "甩", 
          "税", "丝", "绸", "毫", "私", "撕", "搜", "索", "宿", "碎", "损", "缩", "锁", "拳", "坦", "烫", "逃", "桃", "淘", "殊", "征", "倡", "纲", "贴", "挑", "战", "痛", "偷", "投", "透", 
          "土", "吐", "兔", "团", "荐", "退", "歪", "络", "返", "威", "胁", "违", "唯", "维", "伟", "尾", "巴", "委", "屈", "未", "置", "胃", "柔", "吻", "稳", "卧", "屋", "奈", "谓", "武", 
          "勿", "雾", "瞎", "载", "吓", "艳", "县", "限", "肠", "享", "项", "链", "棋", "销", "孝", "歇", "斜", "血", "欣", "赏", "形", "状", "兄", "胸", "叙", "述", "宣", "寻", "询", "迅", 
          "押", "齿", "延", "肃", "宴", "痒", "腰", "摇", "咬", "辈", "旦", "依", "移", "遗", "憾", "乙", "亿", "义", "素", "英", "俊", "雄", "硬", "拥", "挤", "惠", "悠", "犹", "豫", "炸", 
          "幼", "娱", "玉", "订", "防", "圆", "晕", "灾", "糟", "摘", "窄", "粘", "涨", "召", "哲", "珍", "阵", "振", "睁", "齐", "政", "府", "治", "挣", "执", "疗", "秩", "智", "慧", "旬", 
          "猪", "竹", "逐", "渐", "煮", "抓", "饰", "撞", "追", "咨", "姿", "紫", "综", "裁", "阻", "组", "织", "醉", "敬", "遵", "守"]

level6 = ["挨", "癌", "症", "暧", "昧", "昂", "凹", "凸", "奥", "扒", "疤", "拔", "罢", "霸", "掰", "颁", "斑", "侣", "绑", "榜", "磅", "庇", "袱", "沧", "桑", "姆", "障", "仇", "酬", "暴", 
          "露", "曝", "爆", "卑", "鄙", "哀", "惨", "壳", "叛", "诵", "奔", "波", "驰", "拙", "崩", "溃", "甭", "迸", "蹦", "逼", "涕", "喻", "塞", "弊", "端", "臂", "疆", "缘", "策", "贬", 
          "扁", "迁", "辨", "辫", "彰", "憋", "墅", "扭", "濒", "雹", "丙", "拨", "涛", "剥", "削", "伯", "搏", "捕", "捉", "哺", "乳", "堪", "屑", "伐", "署", "缝", "谋", "残", "疾", "酷", 
          "灿", "仓", "苍", "舱", "纵", "嘈", "侧", "岔", "刹", "诧", "异", "搀", "馋", "缠", "阐", "颤", "昌", "盛", "敞", "畅", "钞", "巢", "穴", "嘲", "撤", "淀", "闷", "陈", "呈", "挚", 
          "诺", "堡", "惩", "澄", "橙", "秤", "钝", "赤", "沛", "叠", "崇", "稠", "筹", "储", "蓄", "犯", "川", "舶", "喘", "串", "捧", "炊", "垂", "锤", "粹", "洁", "慈", "祥", "磁", "雌", 
          "伺", "丛", "凑", "鲁", "窜", "摧", "搓", "磋", "挫", "搭", "猎", "仗", "臣", "肆", "歹", "徒", "怠", "逮", "怯", "诞", "辰", "党", "捣", "盗", "窃", "稻", "谷", "罪", "笼", "蹬", 
          "瞪", "堤", "坝", "抵", "抗", "颠", "簸", "缀", "垫", "惦", "奠", "叼", "雕", "吊", "跌", "丁", "叮", "嘱", "盯", "董", "荡", "脉", "栋", "兜", "陡", "峭", "督", "赌", "杜", "伍", 
          "哆", "嗦", "堕", "额", "遏", "恩", "氧", "碳", "誓", "炎", "番", "凡", "殖", "驳", "馈", "滥", "畴", "贩", "御", "纺", "禽", "兽", "翔", "沃", "诽", "谤", "肺", "寝", "墟", "沸", 
          "腾", "寸", "裂", "泌", "歧", "吩", "咐", "坟", "墓", "粉", "愤", "怒", "锋", "逢", "奉", "敷", "衍", "俘", "虏", "辐", "抚", "俯", "蚀", "朽", "副", "赋", "予", "裕", "腹", "泻", 
          "覆", "钙", "旱", "涉", "尴", "尬", "慨", "岗", "港", "湾", "杠", "杆", "峰", "稿", "诫", "疙", "瘩", "鸽", "搁", "割", "颂", "阂", "抒", "蒂", "踪", "耕", "攻", "宫", "殿", "巩", 
          "鸣", "勾", "钩", "孤", "辜", "雇", "佣", "杖", "辖", "贯", "灌", "溉", "罐", "辉", "芒", "阔", "轨", "跪", "棍", "渡", "滤", "瘾", "嗨", "滨", "暄", "罕", "捍", "迈", "耗", "呵", 
          "蔼", "睦", "谐", "嘿", "痕", "狠", "横", "哼", "轰", "烘", "宏", "洪", "哄", "喉", "咙", "吼", "忧", "唤", "啸", "吁", "湖", "泊", "瓣", "蕾", "侨", "妆", "添", "筒", "患", "荒",
          "谬", "唐", "皇", "帝", "昏", "恍", "悟", "晃", "霍", "煌", "毁", "灭", "晤", "贿", "赂", "荤", "浑", "混", "淆", "浊", "箭", "焰", "讥", "饥", "械", "吉", "躁", "嫉", "妒", "忌", 
          "讳", "佳", "肴", "晓", "尖", "锐", "韧", "监", "狱", "煎", "拣", "陋", "谍", "剑", "舰", "艇", "踏", "溅", "鉴", "僵", "桨", "娇", "焦", "侥", "搅", "拌", "缴", "皆", "揭", "奏", 
          "杰", "晶", "截", "竭", "剖", "融", "津", "锦", "晋", "浸", "泡", "茎", "纬", "讶", "兢", "井", "颈", "椎", "惕", "纠", "拘", "鞠", "躬", "咀", "嚼", "沮", "丧", "瞩", "倔", "君", 
          "辟", "拓", "刊", "勘", "探", "侃", "慷", "扛", "拢", "磕", "啃", "坑", "孔", "怖", "惧", "隙", "腔", "扣", "枯", "萎", "泣", "甘", "涩", "挎", "跨", "筐", "旷", "框", "捆", "喇", 
          "叭", "蜡", "烛", "啦", "栏", "惰", "狼", "狈", "吞", "咽", "捞", "牢", "骚", "唠", "叨", "愣", "黎", "碑", "睬", "壮", "粒", "盟", "廉", "晾", "辽", "淋", "吝", "啬", "伶", "俐", 
          "魂", "晨", "袖", "溜", "氓", "聋", "哑", "隆", "垄", "罩", "搂", "炉", "灶", "屡", "履", "掠", "夺", "廓", "胎", "坛", "啰", "唆", "绎", "痹", "蚂", "蚁", "嘛", "埋", "伏", "葬", 
          "蔓", "碌", "盲", "茫", "茂", "枚", "萌", "芽", "猛", "眯", "弥", "惑", "谜", "棉", "疫", "勉", "绘", "瞄", "渺", "藐", "亡", "蔑", "捷", "誉", "膜", "磨", "魔", "抹", "莫", "墨", 
          "睹", "沐", "浴", "辕", "辙", "涵", "拟", "逆", "捏", "凝", "拧", "纽", "奴", "隶", "虐", "挪", "哦", "殴", "呕", "趴", "斥", "徘", "徊", "遣", "攀", "旋", "畔", "庞", "抛", "沫", 
          "烹", "饪", "劈", "惫", "倦", "屁", "譬", "偏", "僻", "浮", "撇", "贫", "庸", "屏", "坡", "颇", "魄", "扑", "铺", "朴", "瀑", "凄", "欺", "协", "旗", "袍", "帜", "乞", "丐", "岂", 
          "蒙", "迄", "掐", "洽", "恰", "徙", "牵", "扯", "逊", "潜", "谴", "劫", "梁", "窍", "翘", "锲", "钦", "侵", "俭", "倾", "澈", "晰", "柬", "帖", "丘", "陵", "曲", "驱", "渠", "缔", 
          "赴", "犬", "陷", "瘸", "嚷", "饶", "恕", "惹", "祸", "盈", "眶", "仁", "溶", "揉", "儒", "若", "撒", "谎", "嫂", "啥", "筛", "烁", "擅", "筋", "捎", "梢", "哨", "奢", "侈", "舌", 
          "氏", "呻", "吟", "绅", "圣", "仙", "审", "渗", "疏", "肖", "锈", "牲", "畜", "尸", "野", "逝", "缚", "竖", "耍", "衰", "涮", "胞", "爽", "泥", "瞬", "斯", "肢", "寺", "庙", "饲", 
          "惮", "耸", "艘", "苏", "讼", "隧", "塌", "塔", "泰", "贪", "婪", "摊", "瘫", "痪", "叹", "倘", "掏", "滔", "陶", "瓷", "汰", "伦", "堂", "田", "径", "舔", "剔", "剂", "衅", "亭", 
          "滞", "膨", "胀", "缉", "讯", "铜", "掷", "秃", "壤", "拖", "妥", "椭", "唾", "挖", "掘", "哇", "娃", "瓦", "丸", "顽", "挽", "惋", "妄", "伪", "畏", "蔚", "雅", "窝", "乌", "诬", 
          "耻", "衷", "赖", "侠", "侮", "辱", "蹈", "昔", "牺", "溪", "熄", "膝", "袭", "媳", "悦", "菌", "峡", "狭", "隘", "霞", "纤", "掀", "贤", "弦", "衔", "嫌", "宪", "阱", "馅", "镇", 
          "镶", "嵌", "巷", "潇", "翼", "携", "泄", "郎", "颖", "薪", "仰", "旺", "腥", "刑", "勃", "凶", "汹", "涌", "膛", "绣", "嗅", "牧", "酗", "喧", "哗", "悬", "崖", "炫", "耀", "霜", 
          "熏", "觅", "巡", "循", "抑", "榨", "鸦", "雀", "淹", "峻", "岩", "沿", "掩", "谣", "遥", "蛮", "液", "帆", "苟", "裳", "仪", "亦", "毅", "擎", "隐", "蔽", "瞒", "婴", "恒", "踊", 
          "郁", "腻", "漆", "紊", "稚", "诱", "渔", "愚", "蠢", "舆", "宇", "宙", "绒", "兆", "欲", "愈", "冤", "枉", "宵", "谱", "岳", "酝", "酿", "蕴", "熨", "砸", "咋", "栽", "宰", "攒", 
          "遭", "殃", "蹋", "噪", "贼", "赠", "扎", "渣", "眨", "诈", "债", "券", "沾", "瞻", "斩", "钉", "崭", "役", "帐", "篷", "蓬", "沼", "泽", "遮", "侦", "稀", "珠", "斟", "酌", "枕", 
          "撼", "蒸", "宗", "郑", "撑", "援", "柱", "枝", "脂", "肪", "侄", "央", "忠", "肿", "瘤", "舟", "州", "粥", "昼", "皱", "纹", "株", "诸", "拄", "宅", "驻", "铸", "拽", "砖", "庄", 
          "稼", "卸", "幢", "悼", "坠", "卓", "琢", "滋", "旨", "棕", "廊", "揍", "赁", "挠", "祖", "钻", "唇", "铭"]


def add_level(input_file, output_file):
    new_rows = []
    char_list = []

    with open(input_file, 'r', encoding='utf-8') as infile:
        reader = csv.reader(infile)
        
        for row in reader:
            
            char, pinyin, simplified, level, meaning = row
            char_list.append(simplified)

            if simplified in level1:
                level = 1
            elif simplified in level2:
                level = 2
            elif simplified in level3:
                level = 3
            elif simplified in level4:
                level = 4
            elif simplified in level5:
                level = 5
            elif simplified in level6:
                level = 6
            else:
                level = 0
        
            new_row = [char, pinyin, simplified, level, meaning]
            new_rows.append(new_row)
    
    with open(output_file, 'w', encoding='utf-8', newline='') as outfile:
        writer = csv.writer(outfile)
        writer.writerows(new_rows)
    

    print("missing lvl1 char: ", )
    for char in level1:
        if char not in char_list:
            print(char)
    print("missing lvl2 char: ", )
    for char in level2:
        if char not in char_list:
            print(char)
    print("missing lvl3 char: ", )
    for char in level3:
        if char not in char_list:
            print(char)
    print("missing lvl4 char: ", )
    for char in level4:
        if char not in char_list:
            print(char)
    print("missing lvl5 char: ", )
    for char in level5:
        if char not in char_list:
            print(char)
    print("missing lvl6 char: ", )
    for char in level6:
        if char not in char_list:
            print(char)


input_file = 'char_list.csv' 
output_file = 'new_char_list.csv'  
add_level(input_file, output_file)